; ModuleID = '/home/gleison/lge/dawn-3.7/UniBench/benchmarks//Parboil/sgemm/src/main.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.std::ios_base::Init" = type { i8 }
%"class.std::basic_ostream" = type { i32 (...)**, %"class.std::basic_ios" }
%"class.std::basic_ios" = type { %"class.std::ios_base", %"class.std::basic_ostream"*, i8, i8, %"class.std::basic_streambuf"*, %"class.std::ctype"*, %"class.std::num_put"*, %"class.std::num_get"* }
%"class.std::ios_base" = type { i32 (...)**, i64, i64, i32, i32, i32, %"struct.std::ios_base::_Callback_list"*, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, %"struct.std::ios_base::_Words"*, %"class.std::locale" }
%"struct.std::ios_base::_Callback_list" = type { %"struct.std::ios_base::_Callback_list"*, void (i32, %"class.std::ios_base"*, i32)*, i32, i32 }
%"struct.std::ios_base::_Words" = type { i8*, i64 }
%"class.std::locale" = type { %"class.std::locale::_Impl"* }
%"class.std::locale::_Impl" = type { i32, %"class.std::locale::facet"**, i64, %"class.std::locale::facet"**, i8** }
%"class.std::locale::facet" = type <{ i32 (...)**, i32, [4 x i8] }>
%"class.std::basic_streambuf" = type { i32 (...)**, i8*, i8*, i8*, i8*, i8*, i8*, %"class.std::locale" }
%"class.std::ctype" = type <{ %"class.std::locale::facet.base", [4 x i8], %struct.__locale_struct*, i8, [7 x i8], i32*, i32*, i16*, i8, [256 x i8], [256 x i8], i8, [6 x i8] }>

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !483, globals: !547, imports: !557)
!1 = !DIFile(filename: "/home/gleison/lge/dawn-3.7/UniBench/benchmarks//Parboil/sgemm/src/main.cc", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!2 = !{}
!3 = !{!4, !10, !19, !72, !78, !79, !81, !85, !97, !102, !109, !110, !116, !269, !283, !327, !371, !388, !412, !413, !416, !473, !474, !475, !224, !476, !478, !482}
!4 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 83, size: 64, align: 32, elements: !6, identifier: "_ZTS11__mbstate_t")
!5 = !DIFile(filename: "/usr/include/wchar.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !"_ZTS11__mbstate_t", file: !5, line: 85, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !"_ZTS11__mbstate_t", file: !5, line: 94, baseType: !"_ZTSN11__mbstate_tUt_E", size: 32, align: 32, offset: 32)
!10 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTS11__mbstate_t", file: !5, line: 86, size: 32, align: 32, elements: !11, identifier: "_ZTSN11__mbstate_tUt_E")
!11 = !{!12, !14}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !"_ZTSN11__mbstate_tUt_E", file: !5, line: 89, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !"_ZTSN11__mbstate_tUt_E", file: !5, line: 93, baseType: !15, size: 32, align: 8)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 32, align: 8, elements: !17)
!16 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!17 = !{!18}
!18 = !DISubrange(count: 4)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !20, line: 273, size: 1728, align: 64, elements: !21, identifier: "_ZTS8_IO_FILE")
!20 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!21 = !{!22, !23, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !37, !39, !40, !41, !45, !47, !49, !53, !56, !58, !60, !61, !62, !63, !67, !68}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS8_IO_FILE", file: !20, line: 274, baseType: !8, size: 32, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !"_ZTS8_IO_FILE", file: !20, line: 279, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !"_ZTS8_IO_FILE", file: !20, line: 280, baseType: !24, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !"_ZTS8_IO_FILE", file: !20, line: 281, baseType: !24, size: 64, align: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !"_ZTS8_IO_FILE", file: !20, line: 282, baseType: !24, size: 64, align: 64, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !"_ZTS8_IO_FILE", file: !20, line: 283, baseType: !24, size: 64, align: 64, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !"_ZTS8_IO_FILE", file: !20, line: 284, baseType: !24, size: 64, align: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !"_ZTS8_IO_FILE", file: !20, line: 285, baseType: !24, size: 64, align: 64, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !"_ZTS8_IO_FILE", file: !20, line: 286, baseType: !24, size: 64, align: 64, offset: 512)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !"_ZTS8_IO_FILE", file: !20, line: 288, baseType: !24, size: 64, align: 64, offset: 576)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !"_ZTS8_IO_FILE", file: !20, line: 289, baseType: !24, size: 64, align: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !"_ZTS8_IO_FILE", file: !20, line: 290, baseType: !24, size: 64, align: 64, offset: 704)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !"_ZTS8_IO_FILE", file: !20, line: 292, baseType: !36, size: 64, align: 64, offset: 768)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS10_IO_marker", size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !"_ZTS8_IO_FILE", file: !20, line: 294, baseType: !38, size: 64, align: 64, offset: 832)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8_IO_FILE", size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !"_ZTS8_IO_FILE", file: !20, line: 296, baseType: !8, size: 32, align: 32, offset: 896)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !"_ZTS8_IO_FILE", file: !20, line: 300, baseType: !8, size: 32, align: 32, offset: 928)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !"_ZTS8_IO_FILE", file: !20, line: 302, baseType: !42, size: 64, align: 64, offset: 960)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 141, baseType: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!44 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !"_ZTS8_IO_FILE", file: !20, line: 306, baseType: !46, size: 16, align: 16, offset: 1024)
!46 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !"_ZTS8_IO_FILE", file: !20, line: 307, baseType: !48, size: 8, align: 8, offset: 1040)
!48 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !"_ZTS8_IO_FILE", file: !20, line: 308, baseType: !50, size: 8, align: 8, offset: 1048)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, align: 8, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 1)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !"_ZTS8_IO_FILE", file: !20, line: 312, baseType: !54, size: 64, align: 64, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !20, line: 182, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS8_IO_FILE", file: !20, line: 321, baseType: !57, size: 64, align: 64, offset: 1152)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !43, line: 142, baseType: !44)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !"_ZTS8_IO_FILE", file: !20, line: 330, baseType: !59, size: 64, align: 64, offset: 1216)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !"_ZTS8_IO_FILE", file: !20, line: 331, baseType: !59, size: 64, align: 64, offset: 1280)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !"_ZTS8_IO_FILE", file: !20, line: 332, baseType: !59, size: 64, align: 64, offset: 1344)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !"_ZTS8_IO_FILE", file: !20, line: 333, baseType: !59, size: 64, align: 64, offset: 1408)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !"_ZTS8_IO_FILE", file: !20, line: 334, baseType: !64, size: 64, align: 64, offset: 1472)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !65, line: 62, baseType: !66)
!65 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!66 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !"_ZTS8_IO_FILE", file: !20, line: 336, baseType: !8, size: 32, align: 32, offset: 1536)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !"_ZTS8_IO_FILE", file: !20, line: 338, baseType: !69, size: 160, align: 8, offset: 1568)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 160, align: 8, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 20)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !73, identifier: "_ZTS13__va_list_tag")
!73 = !{!74, !75, !76, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !13, size: 32, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !13, size: 32, align: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !59, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !59, size: 64, align: 64, offset: 128)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !5, line: 134, flags: DIFlagFwdDecl, identifier: "_ZTS2tm")
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !80, line: 54, size: 768, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
!80 = !DIFile(filename: "/usr/include/locale.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!81 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !83, file: !82, line: 199, size: 1728, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTSSt8ios_base")
!82 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/c++/4.8/bits/ios_base.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!83 = !DINamespace(name: "std", scope: null, file: !84, line: 178)
!84 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/x86_64-linux-gnu/c++/4.8/bits/c++config.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!85 = !DICompositeType(tag: DW_TAG_class_type, name: "Init", scope: !"_ZTSSt8ios_base", file: !82, line: 533, size: 8, align: 8, elements: !86, identifier: "_ZTSNSt8ios_base4InitE")
!86 = !{!87, !90, !92, !96}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_S_refcount", scope: !"_ZTSNSt8ios_base4InitE", file: !82, line: 541, baseType: !88, flags: DIFlagStaticMember)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Atomic_word", file: !89, line: 32, baseType: !8)
!89 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/x86_64-linux-gnu/c++/4.8/bits/atomic_word.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_S_synced_with_stdio", scope: !"_ZTSNSt8ios_base4InitE", file: !82, line: 542, baseType: !91, flags: DIFlagStaticMember)
!91 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!92 = !DISubprogram(name: "Init", scope: !"_ZTSNSt8ios_base4InitE", file: !82, line: 537, type: !93, isLocal: false, isDefinition: false, scopeLine: 537, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt8ios_base4InitE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!96 = !DISubprogram(name: "~Init", scope: !"_ZTSNSt8ios_base4InitE", file: !82, line: 538, type: !93, isLocal: false, isDefinition: false, scopeLine: 538, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !98, line: 57, size: 64, align: 32, elements: !99, identifier: "_ZTS8timezone")
!98 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/time.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !"_ZTS8timezone", file: !98, line: 59, baseType: !8, size: 32, align: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !"_ZTS8timezone", file: !98, line: 60, baseType: !8, size: 32, align: 32, offset: 32)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !103, line: 31, size: 128, align: 64, elements: !104, identifier: "_ZTS7timeval")
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!104 = !{!105, !107}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !"_ZTS7timeval", file: !103, line: 33, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !43, line: 149, baseType: !44)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !"_ZTS7timeval", file: !103, line: 34, baseType: !108, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !43, line: 151, baseType: !44)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !20, line: 188, size: 192, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "pb_Parameters", file: !111, line: 14, size: 128, align: 64, elements: !112, identifier: "_ZTS13pb_Parameters")
!111 = !DIFile(filename: "/home/gleison/lge/dawn-3.7/UniBench/benchmarks//Parboil/sgemm/src/../../common/parboil.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "outFile", scope: !"_ZTS13pb_Parameters", file: !111, line: 15, baseType: !24, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "inpFiles", scope: !"_ZTS13pb_Parameters", file: !111, line: 18, baseType: !115, size: 64, align: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!116 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, std::allocator<float> >", scope: !83, file: !117, line: 210, size: 192, align: 64, elements: !118, templateParams: !266, identifier: "_ZTSSt6vectorIfSaIfEE")
!117 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/c++/4.8/bits/stl_vector.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!118 = !{!119, !120, !124, !130, !139, !144, !145, !149, !152, !156, !161, !162, !163, !167, !171, !172, !173, !176, !177, !180, !181, !184, !187, !196, !204, !207, !208, !209, !212, !215, !216, !217, !225, !232, !235, !236, !239, !242, !245, !248, !251, !252, !253, !254, !255, !258, !263}
!119 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSSt6vectorIfSaIfEE", baseType: !"_ZTSSt12_Vector_baseIfSaIfEE", flags: DIFlagProtected)
!120 = !DISubprogram(name: "vector", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 248, type: !121, isLocal: false, isDefinition: false, scopeLine: 248, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSSt6vectorIfSaIfEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!124 = !DISubprogram(name: "vector", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 256, type: !125, isLocal: false, isDefinition: false, scopeLine: 256, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: false)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !123, !127}
!127 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 234, baseType: !"_ZTSSaIfE")
!130 = !DISubprogram(name: "vector", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 295, type: !131, isLocal: false, isDefinition: false, scopeLine: 295, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: false)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !123, !133, !135, !127}
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !117, line: 232, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", scope: !83, file: !84, line: 180, baseType: !66)
!135 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 222, baseType: !138)
!138 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!139 = !DISubprogram(name: "vector", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 310, type: !140, isLocal: false, isDefinition: false, scopeLine: 310, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !123, !142}
!142 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSSt6vectorIfSaIfEE")
!144 = !DISubprogram(name: "~vector", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 414, type: !121, isLocal: false, isDefinition: false, scopeLine: 414, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!145 = !DISubprogram(name: "operator=", linkageName: "_ZNSt6vectorIfSaIfEEaSERKS1_", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 427, type: !146, isLocal: false, isDefinition: false, scopeLine: 427, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!146 = !DISubroutineType(types: !147)
!147 = !{!148, !123, !142}
!148 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSSt6vectorIfSaIfEE")
!149 = !DISubprogram(name: "assign", linkageName: "_ZNSt6vectorIfSaIfEE6assignEmRKf", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 479, type: !150, isLocal: false, isDefinition: false, scopeLine: 479, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !123, !133, !135}
!152 = !DISubprogram(name: "begin", linkageName: "_ZNSt6vectorIfSaIfEE5beginEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 538, type: !153, isLocal: false, isDefinition: false, scopeLine: 538, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!153 = !DISubroutineType(types: !154)
!154 = !{!155, !123}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "iterator", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 227, baseType: !"_ZTSN9__gnu_cxx17__normal_iteratorIPfSt6vectorIfSaIfEEEE")
!156 = !DISubprogram(name: "begin", linkageName: "_ZNKSt6vectorIfSaIfEE5beginEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 547, type: !157, isLocal: false, isDefinition: false, scopeLine: 547, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!157 = !DISubroutineType(types: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_iterator", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 229, baseType: !"_ZTSN9__gnu_cxx17__normal_iteratorIPKfSt6vectorIfSaIfEEEE")
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!161 = !DISubprogram(name: "end", linkageName: "_ZNSt6vectorIfSaIfEE3endEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 556, type: !153, isLocal: false, isDefinition: false, scopeLine: 556, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!162 = !DISubprogram(name: "end", linkageName: "_ZNKSt6vectorIfSaIfEE3endEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 565, type: !157, isLocal: false, isDefinition: false, scopeLine: 565, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!163 = !DISubprogram(name: "rbegin", linkageName: "_ZNSt6vectorIfSaIfEE6rbeginEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 574, type: !164, isLocal: false, isDefinition: false, scopeLine: 574, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!164 = !DISubroutineType(types: !165)
!165 = !{!166, !123}
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "reverse_iterator", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 231, baseType: !"_ZTSSt16reverse_iteratorIN9__gnu_cxx17__normal_iteratorIPfSt6vectorIfSaIfEEEEE")
!167 = !DISubprogram(name: "rbegin", linkageName: "_ZNKSt6vectorIfSaIfEE6rbeginEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 583, type: !168, isLocal: false, isDefinition: false, scopeLine: 583, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !160}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reverse_iterator", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 230, baseType: !"_ZTSSt16reverse_iteratorIN9__gnu_cxx17__normal_iteratorIPKfSt6vectorIfSaIfEEEEE")
!171 = !DISubprogram(name: "rend", linkageName: "_ZNSt6vectorIfSaIfEE4rendEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 592, type: !164, isLocal: false, isDefinition: false, scopeLine: 592, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!172 = !DISubprogram(name: "rend", linkageName: "_ZNKSt6vectorIfSaIfEE4rendEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 601, type: !168, isLocal: false, isDefinition: false, scopeLine: 601, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!173 = !DISubprogram(name: "size", linkageName: "_ZNKSt6vectorIfSaIfEE4sizeEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 645, type: !174, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!174 = !DISubroutineType(types: !175)
!175 = !{!133, !160}
!176 = !DISubprogram(name: "max_size", linkageName: "_ZNKSt6vectorIfSaIfEE8max_sizeEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 650, type: !174, isLocal: false, isDefinition: false, scopeLine: 650, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!177 = !DISubprogram(name: "resize", linkageName: "_ZNSt6vectorIfSaIfEE6resizeEmf", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 704, type: !178, isLocal: false, isDefinition: false, scopeLine: 704, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!178 = !DISubroutineType(types: !179)
!179 = !{null, !123, !133, !137}
!180 = !DISubprogram(name: "capacity", linkageName: "_ZNKSt6vectorIfSaIfEE8capacityEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 725, type: !174, isLocal: false, isDefinition: false, scopeLine: 725, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!181 = !DISubprogram(name: "empty", linkageName: "_ZNKSt6vectorIfSaIfEE5emptyEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 734, type: !182, isLocal: false, isDefinition: false, scopeLine: 734, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!182 = !DISubroutineType(types: !183)
!183 = !{!91, !160}
!184 = !DISubprogram(name: "reserve", linkageName: "_ZNSt6vectorIfSaIfEE7reserveEm", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 755, type: !185, isLocal: false, isDefinition: false, scopeLine: 755, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !123, !133}
!187 = !DISubprogram(name: "operator[]", linkageName: "_ZNSt6vectorIfSaIfEEixEm", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 770, type: !188, isLocal: false, isDefinition: false, scopeLine: 770, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!188 = !DISubroutineType(types: !189)
!189 = !{!190, !123, !133}
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 225, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIfEEE", file: !192, line: 202, baseType: !193)
!192 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/c++/4.8/ext/alloc_traits.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !"_ZTSSaIfE", file: !194, line: 99, baseType: !195)
!194 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/c++/4.8/bits/allocator.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!195 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !138)
!196 = !DISubprogram(name: "operator[]", linkageName: "_ZNKSt6vectorIfSaIfEEixEm", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 785, type: !197, isLocal: false, isDefinition: false, scopeLine: 785, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!197 = !DISubroutineType(types: !198)
!198 = !{!199, !160, !133}
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reference", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 226, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reference", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIfEEE", file: !192, line: 203, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reference", scope: !"_ZTSSaIfE", file: !194, line: 100, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!204 = !DISubprogram(name: "_M_range_check", linkageName: "_ZNKSt6vectorIfSaIfEE14_M_range_checkEm", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 791, type: !205, isLocal: false, isDefinition: false, scopeLine: 791, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: false)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !160, !133}
!207 = !DISubprogram(name: "at", linkageName: "_ZNSt6vectorIfSaIfEE2atEm", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 810, type: !188, isLocal: false, isDefinition: false, scopeLine: 810, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!208 = !DISubprogram(name: "at", linkageName: "_ZNKSt6vectorIfSaIfEE2atEm", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 828, type: !197, isLocal: false, isDefinition: false, scopeLine: 828, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!209 = !DISubprogram(name: "front", linkageName: "_ZNSt6vectorIfSaIfEE5frontEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 839, type: !210, isLocal: false, isDefinition: false, scopeLine: 839, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!210 = !DISubroutineType(types: !211)
!211 = !{!190, !123}
!212 = !DISubprogram(name: "front", linkageName: "_ZNKSt6vectorIfSaIfEE5frontEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 847, type: !213, isLocal: false, isDefinition: false, scopeLine: 847, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!213 = !DISubroutineType(types: !214)
!214 = !{!199, !160}
!215 = !DISubprogram(name: "back", linkageName: "_ZNSt6vectorIfSaIfEE4backEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 855, type: !210, isLocal: false, isDefinition: false, scopeLine: 855, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!216 = !DISubprogram(name: "back", linkageName: "_ZNKSt6vectorIfSaIfEE4backEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 863, type: !213, isLocal: false, isDefinition: false, scopeLine: 863, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!217 = !DISubprogram(name: "data", linkageName: "_ZNSt6vectorIfSaIfEE4dataEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 878, type: !218, isLocal: false, isDefinition: false, scopeLine: 878, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!218 = !DISubroutineType(types: !219)
!219 = !{!220, !123}
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 223, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !"_ZTSSt12_Vector_baseIfSaIfEE", file: !117, line: 77, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIfEEE", file: !192, line: 199, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !"_ZTSSaIfE", file: !194, line: 97, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!225 = !DISubprogram(name: "data", linkageName: "_ZNKSt6vectorIfSaIfEE4dataEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 886, type: !226, isLocal: false, isDefinition: false, scopeLine: 886, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !160}
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_pointer", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 224, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_pointer", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIfEEE", file: !192, line: 200, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_pointer", scope: !"_ZTSSaIfE", file: !194, line: 98, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!232 = !DISubprogram(name: "push_back", linkageName: "_ZNSt6vectorIfSaIfEE9push_backERKf", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 901, type: !233, isLocal: false, isDefinition: false, scopeLine: 901, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !123, !135}
!235 = !DISubprogram(name: "pop_back", linkageName: "_ZNSt6vectorIfSaIfEE8pop_backEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 937, type: !121, isLocal: false, isDefinition: false, scopeLine: 937, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!236 = !DISubprogram(name: "insert", linkageName: "_ZNSt6vectorIfSaIfEE6insertEN9__gnu_cxx17__normal_iteratorIPfS1_EERKf", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 973, type: !237, isLocal: false, isDefinition: false, scopeLine: 973, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!237 = !DISubroutineType(types: !238)
!238 = !{!155, !123, !155, !135}
!239 = !DISubprogram(name: "insert", linkageName: "_ZNSt6vectorIfSaIfEE6insertEN9__gnu_cxx17__normal_iteratorIPfS1_EEmRKf", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 1023, type: !240, isLocal: false, isDefinition: false, scopeLine: 1023, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !123, !155, !133, !135}
!242 = !DISubprogram(name: "erase", linkageName: "_ZNSt6vectorIfSaIfEE5eraseEN9__gnu_cxx17__normal_iteratorIPfS1_EE", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 1075, type: !243, isLocal: false, isDefinition: false, scopeLine: 1075, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!243 = !DISubroutineType(types: !244)
!244 = !{!155, !123, !155}
!245 = !DISubprogram(name: "erase", linkageName: "_ZNSt6vectorIfSaIfEE5eraseEN9__gnu_cxx17__normal_iteratorIPfS1_EES5_", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 1096, type: !246, isLocal: false, isDefinition: false, scopeLine: 1096, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!246 = !DISubroutineType(types: !247)
!247 = !{!155, !123, !155, !155}
!248 = !DISubprogram(name: "swap", linkageName: "_ZNSt6vectorIfSaIfEE4swapERS1_", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 1108, type: !249, isLocal: false, isDefinition: false, scopeLine: 1108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !123, !148}
!251 = !DISubprogram(name: "clear", linkageName: "_ZNSt6vectorIfSaIfEE5clearEv", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 1125, type: !121, isLocal: false, isDefinition: false, scopeLine: 1125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!252 = !DISubprogram(name: "_M_fill_initialize", linkageName: "_ZNSt6vectorIfSaIfEE18_M_fill_initializeEmRKf", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 1212, type: !150, isLocal: false, isDefinition: false, scopeLine: 1212, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: false)
!253 = !DISubprogram(name: "_M_fill_assign", linkageName: "_ZNSt6vectorIfSaIfEE14_M_fill_assignEmRKf", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 1268, type: !150, isLocal: false, isDefinition: false, scopeLine: 1268, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: false)
!254 = !DISubprogram(name: "_M_fill_insert", linkageName: "_ZNSt6vectorIfSaIfEE14_M_fill_insertEN9__gnu_cxx17__normal_iteratorIPfS1_EEmRKf", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 1309, type: !240, isLocal: false, isDefinition: false, scopeLine: 1309, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: false)
!255 = !DISubprogram(name: "_M_insert_aux", linkageName: "_ZNSt6vectorIfSaIfEE13_M_insert_auxEN9__gnu_cxx17__normal_iteratorIPfS1_EERKf", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 1323, type: !256, isLocal: false, isDefinition: false, scopeLine: 1323, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: false)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !123, !155, !135}
!258 = !DISubprogram(name: "_M_check_len", linkageName: "_ZNKSt6vectorIfSaIfEE12_M_check_lenEmPKc", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 1336, type: !259, isLocal: false, isDefinition: false, scopeLine: 1336, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: false)
!259 = !DISubroutineType(types: !260)
!260 = !{!133, !160, !133, !261}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!263 = !DISubprogram(name: "_M_erase_at_end", linkageName: "_ZNSt6vectorIfSaIfEE15_M_erase_at_endEPf", scope: !"_ZTSSt6vectorIfSaIfEE", file: !117, line: 1350, type: !264, isLocal: false, isDefinition: false, scopeLine: 1350, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: false)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !123, !220}
!266 = !{!267, !268}
!267 = !DITemplateTypeParameter(name: "_Tp", type: !138)
!268 = !DITemplateTypeParameter(name: "_Alloc", type: !"_ZTSSaIfE")
!269 = !DICompositeType(tag: DW_TAG_class_type, name: "allocator<float>", scope: !83, file: !194, line: 92, size: 8, align: 8, elements: !270, templateParams: !282, identifier: "_ZTSSaIfE")
!270 = !{!271, !272, !276, !281}
!271 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSSaIfE", baseType: !"_ZTSN9__gnu_cxx13new_allocatorIfEE", flags: DIFlagPublic)
!272 = !DISubprogram(name: "allocator", scope: !"_ZTSSaIfE", file: !194, line: 113, type: !273, isLocal: false, isDefinition: false, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !275}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSSaIfE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!276 = !DISubprogram(name: "allocator", scope: !"_ZTSSaIfE", file: !194, line: 115, type: !277, isLocal: false, isDefinition: false, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !275, !279}
!279 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSSaIfE")
!281 = !DISubprogram(name: "~allocator", scope: !"_ZTSSaIfE", file: !194, line: 121, type: !273, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!282 = !{!267}
!283 = !DICompositeType(tag: DW_TAG_class_type, name: "new_allocator<float>", scope: !285, file: !284, line: 58, size: 8, align: 8, elements: !287, templateParams: !282, identifier: "_ZTSN9__gnu_cxx13new_allocatorIfEE")
!284 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/c++/4.8/ext/new_allocator.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!285 = !DINamespace(name: "__gnu_cxx", scope: null, file: !286, line: 68)
!286 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/c++/4.8/bits/cpp_type_traits.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!287 = !{!288, !292, !297, !298, !304, !309, !315, !318, !321, !324}
!288 = !DISubprogram(name: "new_allocator", scope: !"_ZTSN9__gnu_cxx13new_allocatorIfEE", file: !284, line: 79, type: !289, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !291}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN9__gnu_cxx13new_allocatorIfEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!292 = !DISubprogram(name: "new_allocator", scope: !"_ZTSN9__gnu_cxx13new_allocatorIfEE", file: !284, line: 81, type: !293, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !291, !295}
!295 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN9__gnu_cxx13new_allocatorIfEE")
!297 = !DISubprogram(name: "~new_allocator", scope: !"_ZTSN9__gnu_cxx13new_allocatorIfEE", file: !284, line: 86, type: !289, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!298 = !DISubprogram(name: "address", linkageName: "_ZNK9__gnu_cxx13new_allocatorIfE7addressERf", scope: !"_ZTSN9__gnu_cxx13new_allocatorIfEE", file: !284, line: 89, type: !299, isLocal: false, isDefinition: false, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!299 = !DISubroutineType(types: !300)
!300 = !{!301, !302, !303}
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !"_ZTSN9__gnu_cxx13new_allocatorIfEE", file: !284, line: 63, baseType: !224)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !"_ZTSN9__gnu_cxx13new_allocatorIfEE", file: !284, line: 65, baseType: !195)
!304 = !DISubprogram(name: "address", linkageName: "_ZNK9__gnu_cxx13new_allocatorIfE7addressERKf", scope: !"_ZTSN9__gnu_cxx13new_allocatorIfEE", file: !284, line: 93, type: !305, isLocal: false, isDefinition: false, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!305 = !DISubroutineType(types: !306)
!306 = !{!307, !302, !308}
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_pointer", scope: !"_ZTSN9__gnu_cxx13new_allocatorIfEE", file: !284, line: 64, baseType: !231)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reference", scope: !"_ZTSN9__gnu_cxx13new_allocatorIfEE", file: !284, line: 66, baseType: !202)
!309 = !DISubprogram(name: "allocate", linkageName: "_ZN9__gnu_cxx13new_allocatorIfE8allocateEmPKv", scope: !"_ZTSN9__gnu_cxx13new_allocatorIfEE", file: !284, line: 99, type: !310, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!310 = !DISubroutineType(types: !311)
!311 = !{!301, !291, !312, !313}
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !284, line: 61, baseType: !134)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!315 = !DISubprogram(name: "deallocate", linkageName: "_ZN9__gnu_cxx13new_allocatorIfE10deallocateEPfm", scope: !"_ZTSN9__gnu_cxx13new_allocatorIfEE", file: !284, line: 109, type: !316, isLocal: false, isDefinition: false, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !291, !301, !312}
!318 = !DISubprogram(name: "max_size", linkageName: "_ZNK9__gnu_cxx13new_allocatorIfE8max_sizeEv", scope: !"_ZTSN9__gnu_cxx13new_allocatorIfEE", file: !284, line: 113, type: !319, isLocal: false, isDefinition: false, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!319 = !DISubroutineType(types: !320)
!320 = !{!312, !302}
!321 = !DISubprogram(name: "construct", linkageName: "_ZN9__gnu_cxx13new_allocatorIfE9constructEPfRKf", scope: !"_ZTSN9__gnu_cxx13new_allocatorIfEE", file: !284, line: 129, type: !322, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !291, !301, !202}
!324 = !DISubprogram(name: "destroy", linkageName: "_ZN9__gnu_cxx13new_allocatorIfE7destroyEPf", scope: !"_ZTSN9__gnu_cxx13new_allocatorIfEE", file: !284, line: 133, type: !325, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !291, !301}
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Vector_base<float, std::allocator<float> >", scope: !83, file: !117, line: 72, size: 192, align: 64, elements: !328, templateParams: !266, identifier: "_ZTSSt12_Vector_baseIfSaIfEE")
!328 = !{!329, !330, !338, !345, !349, !352, !357, !360, !363, !364, !367, !370}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: !"_ZTSSt12_Vector_baseIfSaIfEE", file: !117, line: 164, baseType: !"_ZTSNSt12_Vector_baseIfSaIfEE12_Vector_implE", size: 192, align: 64)
!330 = !DISubprogram(name: "_M_get_Tp_allocator", linkageName: "_ZNSt12_Vector_baseIfSaIfEE19_M_get_Tp_allocatorEv", scope: !"_ZTSSt12_Vector_baseIfSaIfEE", file: !117, line: 113, type: !331, isLocal: false, isDefinition: false, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false)
!331 = !DISubroutineType(types: !332)
!332 = !{!333, !337}
!333 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Tp_alloc_type", scope: !"_ZTSSt12_Vector_baseIfSaIfEE", file: !117, line: 75, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "other", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIfEE6rebindIfEE", file: !192, line: 235, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "other", scope: !"_ZTSNSaIfE6rebindIfEE", file: !194, line: 105, baseType: !"_ZTSSaIfE")
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSSt12_Vector_baseIfSaIfEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!338 = !DISubprogram(name: "_M_get_Tp_allocator", linkageName: "_ZNKSt12_Vector_baseIfSaIfEE19_M_get_Tp_allocatorEv", scope: !"_ZTSSt12_Vector_baseIfSaIfEE", file: !117, line: 117, type: !339, isLocal: false, isDefinition: false, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false)
!339 = !DISubroutineType(types: !340)
!340 = !{!341, !343}
!341 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSSt12_Vector_baseIfSaIfEE")
!345 = !DISubprogram(name: "get_allocator", linkageName: "_ZNKSt12_Vector_baseIfSaIfEE13get_allocatorEv", scope: !"_ZTSSt12_Vector_baseIfSaIfEE", file: !117, line: 121, type: !346, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!346 = !DISubroutineType(types: !347)
!347 = !{!348, !343}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !"_ZTSSt12_Vector_baseIfSaIfEE", file: !117, line: 110, baseType: !"_ZTSSaIfE")
!349 = !DISubprogram(name: "_Vector_base", scope: !"_ZTSSt12_Vector_baseIfSaIfEE", file: !117, line: 124, type: !350, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !337}
!352 = !DISubprogram(name: "_Vector_base", scope: !"_ZTSSt12_Vector_baseIfSaIfEE", file: !117, line: 127, type: !353, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !337, !355}
!355 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!357 = !DISubprogram(name: "_Vector_base", scope: !"_ZTSSt12_Vector_baseIfSaIfEE", file: !117, line: 130, type: !358, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !337, !134}
!360 = !DISubprogram(name: "_Vector_base", scope: !"_ZTSSt12_Vector_baseIfSaIfEE", file: !117, line: 134, type: !361, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !337, !134, !355}
!363 = !DISubprogram(name: "~_Vector_base", scope: !"_ZTSSt12_Vector_baseIfSaIfEE", file: !117, line: 159, type: !350, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false)
!364 = !DISubprogram(name: "_M_allocate", linkageName: "_ZNSt12_Vector_baseIfSaIfEE11_M_allocateEm", scope: !"_ZTSSt12_Vector_baseIfSaIfEE", file: !117, line: 167, type: !365, isLocal: false, isDefinition: false, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: false)
!365 = !DISubroutineType(types: !366)
!366 = !{!221, !337, !134}
!367 = !DISubprogram(name: "_M_deallocate", linkageName: "_ZNSt12_Vector_baseIfSaIfEE13_M_deallocateEPfm", scope: !"_ZTSSt12_Vector_baseIfSaIfEE", file: !117, line: 171, type: !368, isLocal: false, isDefinition: false, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: false)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !337, !221, !134}
!370 = !DISubprogram(name: "_M_create_storage", linkageName: "_ZNSt12_Vector_baseIfSaIfEE17_M_create_storageEm", scope: !"_ZTSSt12_Vector_baseIfSaIfEE", file: !117, line: 179, type: !358, isLocal: false, isDefinition: false, scopeLine: 179, flags: DIFlagPrivate | DIFlagPrototyped, isOptimized: false)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Vector_impl", scope: !"_ZTSSt12_Vector_baseIfSaIfEE", file: !117, line: 79, size: 192, align: 64, elements: !372, identifier: "_ZTSNSt12_Vector_baseIfSaIfEE12_Vector_implE")
!372 = !{!373, !374, !375, !376, !377, !381, !384}
!373 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt12_Vector_baseIfSaIfEE12_Vector_implE", baseType: !334)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_M_start", scope: !"_ZTSNSt12_Vector_baseIfSaIfEE12_Vector_implE", file: !117, line: 82, baseType: !221, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_M_finish", scope: !"_ZTSNSt12_Vector_baseIfSaIfEE12_Vector_implE", file: !117, line: 83, baseType: !221, size: 64, align: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_M_end_of_storage", scope: !"_ZTSNSt12_Vector_baseIfSaIfEE12_Vector_implE", file: !117, line: 84, baseType: !221, size: 64, align: 64, offset: 128)
!377 = !DISubprogram(name: "_Vector_impl", scope: !"_ZTSNSt12_Vector_baseIfSaIfEE12_Vector_implE", file: !117, line: 86, type: !378, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt12_Vector_baseIfSaIfEE12_Vector_implE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!381 = !DISubprogram(name: "_Vector_impl", scope: !"_ZTSNSt12_Vector_baseIfSaIfEE12_Vector_implE", file: !117, line: 90, type: !382, isLocal: false, isDefinition: false, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !380, !341}
!384 = !DISubprogram(name: "_M_swap_data", linkageName: "_ZNSt12_Vector_baseIfSaIfEE12_Vector_impl12_M_swap_dataERS2_", scope: !"_ZTSNSt12_Vector_baseIfSaIfEE12_Vector_implE", file: !117, line: 101, type: !385, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !380, !387}
!387 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt12_Vector_baseIfSaIfEE12_Vector_implE")
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "__alloc_traits<std::allocator<float> >", scope: !285, file: !192, line: 121, size: 8, align: 8, elements: !389, templateParams: !411, identifier: "_ZTSN9__gnu_cxx14__alloc_traitsISaIfEEE")
!389 = !{!390, !396, !399, !402, !405, !408}
!390 = !DISubprogram(name: "allocate", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIfEE8allocateERS1_m", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIfEEE", file: !192, line: 208, type: !391, isLocal: false, isDefinition: false, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: false)
!391 = !DISubroutineType(types: !392)
!392 = !{!222, !393, !394}
!393 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSSaIfE")
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIfEEE", file: !192, line: 204, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSSaIfE", file: !194, line: 95, baseType: !134)
!396 = !DISubprogram(name: "deallocate", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIfEE10deallocateERS1_Pfm", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIfEEE", file: !192, line: 211, type: !397, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: false)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !393, !222, !394}
!399 = !DISubprogram(name: "destroy", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIfEE7destroyERS1_Pf", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIfEEE", file: !192, line: 218, type: !400, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: false)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !393, !222}
!402 = !DISubprogram(name: "max_size", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIfEE8max_sizeERKS1_", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIfEEE", file: !192, line: 221, type: !403, isLocal: false, isDefinition: false, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: false)
!403 = !DISubroutineType(types: !404)
!404 = !{!394, !279}
!405 = !DISubprogram(name: "_S_select_on_copy", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIfEE17_S_select_on_copyERKS1_", scope: !"_ZTSN9__gnu_cxx14__alloc_traitsISaIfEEE", file: !192, line: 224, type: !406, isLocal: false, isDefinition: false, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: false)
!406 = !DISubroutineType(types: !407)
!407 = !{!279, !279}
