; ModuleID = '/home/gleison/lge/dawn-3.7/UniBench/benchmarks//Rodinia/srad/src/graphics.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.1 = private unnamed_addr constant [45 x i8] c"The file was not created/opened for writing\0A\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"P2\0A\00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c"%d %d\0A\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1
@.str.5 = private unnamed_addr constant [4 x i8] c"%d \00", align 1
@.str.6 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@.str.7 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.8 = private unnamed_addr constant [37 x i8] c"The file was not opened for reading\0A\00", align 1
@.str.9 = private unnamed_addr constant [3 x i8] c"%d\00", align 1

; Function Attrs: nounwind uwtable
define void @write_graphics(i8* %filename, float* %input, i32 %data_rows, i32 %data_cols, i32 %major, i32 %data_range) #0 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7)
!1 = !DIFile(filename: "/home/gleison/lge/dawn-3.7/UniBench/benchmarks//Rodinia/srad/src/graphics.c", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!7 = !{!8, !14}
!8 = !DISubprogram(name: "write_graphics", scope: !1, file: !1, line: 22, type: !9, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*, float*, i32, i32, i32, i32)* @write_graphics, variables: !2)
!9 = !DISubroutineType(types: !10)
!10 = !{null, !11, !13, !5, !5, !5, !5}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!14 = !DISubprogram(name: "read_graphics", scope: !1, file: !1, line: 91, type: !15, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*, float*, i32, i32, i32)* @read_graphics, variables: !2)
!15 = !DISubroutineType(types: !16)
!16 = !{null, !11, !13, !5, !5, !5}
!17 = !{i32 2, !"Dwarf Version", i32 4}
!18 = !{i32 2, !"Debug Info Version", i32 3}
!19 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!20 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !8, file: !1, line: 22, type: !11)
!21 = !DIExpression()
!22 = !DILocation(line: 22, column: 28, scope: !8)
!23 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 2, scope: !8, file: !1, line: 23, type: !13)
!24 = !DILocation(line: 23, column: 17, scope: !8)
!25 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data_rows", arg: 3, scope: !8, file: !1, line: 24, type: !5)
!26 = !DILocation(line: 24, column: 14, scope: !8)
!27 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data_cols", arg: 4, scope: !8, file: !1, line: 25, type: !5)
!28 = !DILocation(line: 25, column: 14, scope: !8)
!29 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "major", arg: 5, scope: !8, file: !1, line: 26, type: !5)
!30 = !DILocation(line: 26, column: 14, scope: !8)
!31 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data_range", arg: 6, scope: !8, file: !1, line: 27, type: !5)
!32 = !DILocation(line: 27, column: 14, scope: !8)
!33 = !DILocation(line: 40, column: 8, scope: !8)
!34 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fid", scope: !8, file: !1, line: 33, type: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !37, line: 49, baseType: !38)
!37 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !39, line: 273, size: 1728, align: 64, elements: !40)
!39 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !61, !62, !63, !64, !68, !70, !72, !76, !79, !81, !82, !83, !84, !85, !89, !90}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !38, file: !39, line: 274, baseType: !5, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !38, file: !39, line: 279, baseType: !11, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !38, file: !39, line: 280, baseType: !11, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !38, file: !39, line: 281, baseType: !11, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !38, file: !39, line: 282, baseType: !11, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !38, file: !39, line: 283, baseType: !11, size: 64, align: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !38, file: !39, line: 284, baseType: !11, size: 64, align: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !38, file: !39, line: 285, baseType: !11, size: 64, align: 64, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !38, file: !39, line: 286, baseType: !11, size: 64, align: 64, offset: 512)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !38, file: !39, line: 288, baseType: !11, size: 64, align: 64, offset: 576)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !38, file: !39, line: 289, baseType: !11, size: 64, align: 64, offset: 640)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !38, file: !39, line: 290, baseType: !11, size: 64, align: 64, offset: 704)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !38, file: !39, line: 292, baseType: !54, size: 64, align: 64, offset: 768)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !39, line: 188, size: 192, align: 64, elements: !56)
!56 = !{!57, !58, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !55, file: !39, line: 189, baseType: !54, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !55, file: !39, line: 190, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !55, file: !39, line: 194, baseType: !5, size: 32, align: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !38, file: !39, line: 294, baseType: !59, size: 64, align: 64, offset: 832)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !38, file: !39, line: 296, baseType: !5, size: 32, align: 32, offset: 896)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !38, file: !39, line: 300, baseType: !5, size: 32, align: 32, offset: 928)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !38, file: !39, line: 302, baseType: !65, size: 64, align: 64, offset: 960)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !66, line: 141, baseType: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!67 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !38, file: !39, line: 306, baseType: !69, size: 16, align: 16, offset: 1024)
!69 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !38, file: !39, line: 307, baseType: !71, size: 8, align: 8, offset: 1040)
!71 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !38, file: !39, line: 308, baseType: !73, size: 8, align: 8, offset: 1048)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, align: 8, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 1)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !38, file: !39, line: 312, baseType: !77, size: 64, align: 64, offset: 1088)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !39, line: 182, baseType: null)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !38, file: !39, line: 321, baseType: !80, size: 64, align: 64, offset: 1152)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !66, line: 142, baseType: !67)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !38, file: !39, line: 330, baseType: !4, size: 64, align: 64, offset: 1216)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !38, file: !39, line: 331, baseType: !4, size: 64, align: 64, offset: 1280)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !38, file: !39, line: 332, baseType: !4, size: 64, align: 64, offset: 1344)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !38, file: !39, line: 333, baseType: !4, size: 64, align: 64, offset: 1408)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !38, file: !39, line: 334, baseType: !86, size: 64, align: 64, offset: 1472)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !87, line: 62, baseType: !88)
!87 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!88 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !38, file: !39, line: 336, baseType: !5, size: 32, align: 32, offset: 1536)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !38, file: !39, line: 338, baseType: !91, size: 160, align: 8, offset: 1568)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, align: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 20)
!94 = !DILocation(line: 33, column: 8, scope: !8)
!95 = !DILocation(line: 41, column: 10, scope: !96)
!96 = distinct !DILexicalBlock(scope: !8, file: !1, line: 41, column: 6)
!97 = !DILocation(line: 41, column: 6, scope: !8)
!98 = !DILocation(line: 42, column: 3, scope: !99)
!99 = distinct !DILexicalBlock(scope: !96, file: !1, line: 41, column: 19)
!100 = !DILocation(line: 43, column: 3, scope: !99)
!101 = !DILocation(line: 50, column: 2, scope: !8)
!102 = !DILocation(line: 51, column: 2, scope: !8)
!103 = !DILocation(line: 52, column: 2, scope: !8)
!104 = !DILocation(line: 59, column: 10, scope: !105)
!105 = distinct !DILexicalBlock(scope: !8, file: !1, line: 59, column: 5)
!106 = !DILocation(line: 59, column: 5, scope: !8)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !8, file: !1, line: 34, type: !5)
!108 = !DILocation(line: 34, column: 9, scope: !8)
!109 = !DILocation(line: 64, column: 4, scope: !110)
!110 = distinct !DILexicalBlock(scope: !111, file: !1, line: 60, column: 29)
!111 = distinct !DILexicalBlock(scope: !112, file: !1, line: 60, column: 3)
!112 = distinct !DILexicalBlock(scope: !113, file: !1, line: 60, column: 3)
!113 = distinct !DILexicalBlock(scope: !105, file: !1, line: 59, column: 14)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !8, file: !1, line: 34, type: !5)
!115 = !DILocation(line: 34, column: 6, scope: !8)
!116 = !DILocation(line: 60, column: 7, scope: !112)
!117 = !DILocation(line: 60, column: 13, scope: !111)
!118 = !DILocation(line: 60, column: 3, scope: !112)
!119 = !DILocation(line: 61, column: 8, scope: !120)
!120 = distinct !DILexicalBlock(scope: !110, file: !1, line: 61, column: 4)
!121 = !DILocation(line: 61, column: 14, scope: !122)
!122 = distinct !DILexicalBlock(scope: !120, file: !1, line: 61, column: 4)
!123 = !DILocation(line: 61, column: 4, scope: !120)
!124 = !DILocation(line: 62, column: 37, scope: !125)
!125 = distinct !DILexicalBlock(scope: !122, file: !1, line: 61, column: 30)
!126 = !DILocation(line: 62, column: 47, scope: !125)
!127 = !DILocation(line: 62, column: 30, scope: !125)
!128 = !DILocation(line: 62, column: 25, scope: !125)
!129 = !DILocation(line: 62, column: 5, scope: !125)
!130 = !DILocation(line: 63, column: 4, scope: !125)
!131 = !DILocation(line: 61, column: 27, scope: !122)
!132 = !DILocation(line: 61, column: 4, scope: !122)
!133 = !DILocation(line: 65, column: 3, scope: !110)
!134 = !DILocation(line: 60, column: 26, scope: !111)
!135 = !DILocation(line: 60, column: 3, scope: !111)
!136 = !DILocation(line: 66, column: 2, scope: !113)
!137 = !DILocation(line: 73, column: 4, scope: !138)
!138 = distinct !DILexicalBlock(scope: !139, file: !1, line: 69, column: 29)
!139 = distinct !DILexicalBlock(scope: !140, file: !1, line: 69, column: 3)
!140 = distinct !DILexicalBlock(scope: !141, file: !1, line: 69, column: 3)
!141 = distinct !DILexicalBlock(scope: !105, file: !1, line: 68, column: 6)
!142 = !DILocation(line: 69, column: 7, scope: !140)
!143 = !DILocation(line: 69, column: 13, scope: !139)
!144 = !DILocation(line: 69, column: 3, scope: !140)
!145 = !DILocation(line: 70, column: 8, scope: !146)
!146 = distinct !DILexicalBlock(scope: !138, file: !1, line: 70, column: 4)
!147 = !DILocation(line: 70, column: 14, scope: !148)
!148 = distinct !DILexicalBlock(scope: !146, file: !1, line: 70, column: 4)
!149 = !DILocation(line: 70, column: 4, scope: !146)
!150 = !DILocation(line: 71, column: 37, scope: !151)
!151 = distinct !DILexicalBlock(scope: !148, file: !1, line: 70, column: 30)
!152 = !DILocation(line: 71, column: 47, scope: !151)
!153 = !DILocation(line: 71, column: 30, scope: !151)
!154 = !DILocation(line: 71, column: 25, scope: !151)
