; ModuleID = '/home/gleison/lge/dawn-3.7/UniBench/benchmarks//Rodinia/bfs/src/bfs.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.timezone = type { i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.Node = type { i32, i32 }

@.str = private unnamed_addr constant [35 x i8] c"Error return from gettimeofday: %d\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [38 x i8] c"Usage: %s <num_threads> <input_file>\0A\00", align 1
@.str.2 = private unnamed_addr constant [74 x i8] c"Non-Matching CPU-GPU Outputs Beyond Error Threshold of %4.2f Percent: %d\0A\00", align 1
@.str.3 = private unnamed_addr constant [14 x i8] c"Reading File\0A\00", align 1
@.str.4 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@fp = common global %struct._IO_FILE* null, align 8
@.str.5 = private unnamed_addr constant [26 x i8] c"Error Reading graph file\0A\00", align 1
@.str.6 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.7 = private unnamed_addr constant [6 x i8] c"%d %d\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !12, globals: !40)
!1 = !DIFile(filename: "/home/gleison/lge/dawn-3.7/UniBench/benchmarks//Rodinia/bfs/src/bfs.c", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!2 = !{}
!3 = !{!4, !11}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !1, line: 18, baseType: !6)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !1, line: 14, size: 64, align: 32, elements: !7)
!7 = !{!8, !10}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "starting", scope: !6, file: !1, line: 16, baseType: !9, size: 32, align: 32)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "no_of_edges", scope: !6, file: !1, line: 17, baseType: !9, size: 32, align: 32, offset: 32)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!12 = !{!13, !18, !22, !25, !31, !34, !37}
!13 = !DISubprogram(name: "rtclock", scope: !14, file: !14, line: 7, type: !15, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, function: double ()* @rtclock, variables: !2)
!14 = !DIFile(filename: "/home/gleison/lge/dawn-3.7/UniBench/benchmarks//Rodinia/bfs/src/../../common/rodiniaUtilFunctions.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!15 = !DISubroutineType(types: !16)
!16 = !{!17}
!17 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!18 = !DISubprogram(name: "absVal", scope: !14, file: !14, line: 18, type: !19, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, function: float (float)* @absVal, variables: !2)
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !21}
!21 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!22 = !DISubprogram(name: "percentDiff", scope: !14, file: !14, line: 32, type: !23, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, function: float (double, double)* @percentDiff, variables: !2)
!23 = !DISubroutineType(types: !24)
!24 = !{!21, !17, !17}
!25 = !DISubprogram(name: "Usage", scope: !1, file: !1, line: 29, type: !26, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false, function: void (i32, i8**)* @Usage, variables: !2)
!26 = !DISubroutineType(types: !27)
!27 = !{null, !9, !28}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!31 = !DISubprogram(name: "main", scope: !1, file: !1, line: 37, type: !32, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!32 = !DISubroutineType(types: !33)
!33 = !{!9, !9, !28}
!34 = !DISubprogram(name: "compareResults", scope: !1, file: !1, line: 45, type: !35, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, function: void (i32*, i32*, i32)* @compareResults, variables: !2)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !11, !11, !9}
!37 = !DISubprogram(name: "BFSGraph", scope: !1, file: !1, line: 63, type: !38, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, function: void (i32, i8**, i32, i32)* @BFSGraph, variables: !2)
!38 = !DISubroutineType(types: !39)
!39 = !{null, !9, !28, !9, !9}
!40 = !{!41}
!41 = !DIGlobalVariable(name: "fp", scope: !0, file: !1, line: 11, type: !42, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @fp)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !44, line: 49, baseType: !45)
!44 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 273, size: 1728, align: 64, elements: !47)
!46 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !68, !69, !70, !71, !75, !77, !79, !83, !86, !88, !90, !91, !92, !93, !97, !98}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !45, file: !46, line: 274, baseType: !9, size: 32, align: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !45, file: !46, line: 279, baseType: !29, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !45, file: !46, line: 280, baseType: !29, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !45, file: !46, line: 281, baseType: !29, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !45, file: !46, line: 282, baseType: !29, size: 64, align: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !45, file: !46, line: 283, baseType: !29, size: 64, align: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !45, file: !46, line: 284, baseType: !29, size: 64, align: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !45, file: !46, line: 285, baseType: !29, size: 64, align: 64, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !45, file: !46, line: 286, baseType: !29, size: 64, align: 64, offset: 512)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !45, file: !46, line: 288, baseType: !29, size: 64, align: 64, offset: 576)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !45, file: !46, line: 289, baseType: !29, size: 64, align: 64, offset: 640)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !45, file: !46, line: 290, baseType: !29, size: 64, align: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !45, file: !46, line: 292, baseType: !61, size: 64, align: 64, offset: 768)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !46, line: 188, size: 192, align: 64, elements: !63)
!63 = !{!64, !65, !67}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !62, file: !46, line: 189, baseType: !61, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !62, file: !46, line: 190, baseType: !66, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !62, file: !46, line: 194, baseType: !9, size: 32, align: 32, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !45, file: !46, line: 294, baseType: !66, size: 64, align: 64, offset: 832)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !45, file: !46, line: 296, baseType: !9, size: 32, align: 32, offset: 896)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !45, file: !46, line: 300, baseType: !9, size: 32, align: 32, offset: 928)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !45, file: !46, line: 302, baseType: !72, size: 64, align: 64, offset: 960)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !73, line: 141, baseType: !74)
!73 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!74 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !45, file: !46, line: 306, baseType: !76, size: 16, align: 16, offset: 1024)
!76 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !45, file: !46, line: 307, baseType: !78, size: 8, align: 8, offset: 1040)
!78 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !45, file: !46, line: 308, baseType: !80, size: 8, align: 8, offset: 1048)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 1)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !45, file: !46, line: 312, baseType: !84, size: 64, align: 64, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !46, line: 182, baseType: null)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !45, file: !46, line: 321, baseType: !87, size: 64, align: 64, offset: 1152)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !73, line: 142, baseType: !74)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !45, file: !46, line: 330, baseType: !89, size: 64, align: 64, offset: 1216)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !45, file: !46, line: 331, baseType: !89, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !45, file: !46, line: 332, baseType: !89, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !45, file: !46, line: 333, baseType: !89, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !45, file: !46, line: 334, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !45, file: !46, line: 336, baseType: !9, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !45, file: !46, line: 338, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !{i32 2, !"Dwarf Version", i32 4}
!103 = !{i32 2, !"Debug Info Version", i32 3}
!104 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Tzp", scope: !13, file: !14, line: 9, type: !106)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !107, line: 57, size: 64, align: 32, elements: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/time.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !106, file: !107, line: 59, baseType: !9, size: 32, align: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !106, file: !107, line: 60, baseType: !9, size: 32, align: 32, offset: 32)
!111 = !DIExpression()
!112 = !DILocation(line: 9, column: 21, scope: !13)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Tp", scope: !13, file: !14, line: 10, type: !114)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !115, line: 31, size: 128, align: 64, elements: !116)
!115 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!116 = !{!117, !119}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !114, file: !115, line: 33, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !73, line: 149, baseType: !74)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !114, file: !115, line: 34, baseType: !120, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !73, line: 151, baseType: !74)
!121 = !DILocation(line: 10, column: 20, scope: !13)
!122 = !DILocation(line: 12, column: 12, scope: !13)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stat", scope: !13, file: !14, line: 11, type: !9)
!124 = !DILocation(line: 11, column: 9, scope: !13)
!125 = !DILocation(line: 13, column: 14, scope: !126)
!126 = distinct !DILexicalBlock(scope: !13, file: !14, line: 13, column: 9)
!127 = !DILocation(line: 13, column: 9, scope: !13)
!128 = !DILocation(line: 13, column: 20, scope: !126)
!129 = !DILocation(line: 14, column: 15, scope: !13)
!130 = !DILocation(line: 14, column: 12, scope: !13)
!131 = !DILocation(line: 14, column: 27, scope: !13)
!132 = !DILocation(line: 14, column: 24, scope: !13)
!133 = !DILocation(line: 14, column: 34, scope: !13)
!134 = !DILocation(line: 14, column: 22, scope: !13)
!135 = !DILocation(line: 14, column: 5, scope: !13)
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !18, file: !14, line: 18, type: !21)
!137 = !DILocation(line: 18, column: 20, scope: !18)
!138 = !DILocation(line: 20, column: 7, scope: !139)
!139 = distinct !DILexicalBlock(scope: !18, file: !14, line: 20, column: 5)
!140 = !DILocation(line: 20, column: 5, scope: !18)
!141 = !DILocation(line: 22, column: 13, scope: !142)
!142 = distinct !DILexicalBlock(scope: !139, file: !14, line: 21, column: 2)
!143 = !DILocation(line: 22, column: 3, scope: !142)
!144 = !DILocation(line: 26, column: 3, scope: !145)
!145 = distinct !DILexicalBlock(scope: !139, file: !14, line: 25, column: 2)
!146 = !DILocation(line: 28, column: 1, scope: !18)
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "val1", arg: 1, scope: !22, file: !14, line: 32, type: !17)
!148 = !DILocation(line: 32, column: 26, scope: !22)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "val2", arg: 2, scope: !22, file: !14, line: 32, type: !17)
!150 = !DILocation(line: 32, column: 39, scope: !22)
!151 = !DILocation(line: 34, column: 14, scope: !152)
!152 = distinct !DILexicalBlock(scope: !22, file: !14, line: 34, column: 6)
!153 = !DILocation(line: 34, column: 7, scope: !152)
!154 = !DILocation(line: 34, column: 20, scope: !152)
!155 = !DILocation(line: 34, column: 28, scope: !152)
!156 = !DILocation(line: 34, column: 39, scope: !157)
!157 = !DILexicalBlockFile(scope: !152, file: !14, discriminator: 1)
!158 = !DILocation(line: 34, column: 32, scope: !152)
!159 = !DILocation(line: 34, column: 45, scope: !152)
!160 = !DILocation(line: 34, column: 6, scope: !22)
!161 = !DILocation(line: 36, column: 3, scope: !162)
!162 = distinct !DILexicalBlock(scope: !152, file: !14, line: 35, column: 2)
!163 = !DILocation(line: 41, column: 43, scope: !164)
!164 = distinct !DILexicalBlock(scope: !152, file: !14, line: 40, column: 2)
!165 = !DILocation(line: 41, column: 38, scope: !164)
!166 = !DILocation(line: 41, column: 31, scope: !164)
!167 = !DILocation(line: 41, column: 65, scope: !164)
!168 = !DILocation(line: 41, column: 60, scope: !164)
!169 = !DILocation(line: 41, column: 53, scope: !164)
!170 = !DILocation(line: 41, column: 51, scope: !164)
!171 = !DILocation(line: 41, column: 24, scope: !164)
!172 = !DILocation(line: 41, column: 21, scope: !164)
!173 = !DILocation(line: 41, column: 7, scope: !164)
!174 = !DILocation(line: 43, column: 1, scope: !22)
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !25, file: !1, line: 29, type: !9)
!176 = !DILocation(line: 29, column: 16, scope: !25)
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !25, file: !1, line: 29, type: !28)
!178 = !DILocation(line: 29, column: 28, scope: !25)
!179 = !DILocation(line: 31, column: 9, scope: !25)
!180 = !DILocation(line: 31, column: 58, scope: !25)
