; ModuleID = '/home/gleison/lge/dawn-3.7/UniBench/benchmarks//Rodinia/lud/src/tools/gen_input.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [37 x i8] c"./gen_input [Matrix_Dimension_size]\0A\00", align 1
@.str.1 = private unnamed_addr constant [25 x i8] c"Can not allocate memory\0A\00", align 1
@L_FNAME = common global [32 x i8] zeroinitializer, align 16
@.str.2 = private unnamed_addr constant [9 x i8] c"l-%d.dat\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"wb\00", align 1
@.str.4 = private unnamed_addr constant [21 x i8] c"Cannot open file %s\0A\00", align 1
@U_FNAME = common global [32 x i8] zeroinitializer, align 16
@.str.5 = private unnamed_addr constant [9 x i8] c"u-%d.dat\00", align 1
@A_FNAME = common global [32 x i8] zeroinitializer, align 16
@.str.6 = private unnamed_addr constant [7 x i8] c"%d.dat\00", align 1
@.str.7 = private unnamed_addr constant [4 x i8] c"%f \00", align 1
@.str.8 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@.str.9 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1

; Function Attrs: nounwind uwtable

!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!17 = !{!18, !22, !23}
!18 = !DIGlobalVariable(name: "L_FNAME", scope: !0, file: !1, line: 13, type: !19, isLocal: false, isDefinition: true, variable: [32 x i8]* @L_FNAME)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 256, align: 8, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 32)
!22 = !DIGlobalVariable(name: "U_FNAME", scope: !0, file: !1, line: 13, type: !19, isLocal: false, isDefinition: true, variable: [32 x i8]* @U_FNAME)
!23 = !DIGlobalVariable(name: "A_FNAME", scope: !0, file: !1, line: 13, type: !19, isLocal: false, isDefinition: true, variable: [32 x i8]* @A_FNAME)
!24 = !{i32 2, !"Dwarf Version", i32 4}
!25 = !{i32 2, !"Debug Info Version", i32 3}
!26 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!27 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !10, file: !1, line: 15, type: !13)
!28 = !DIExpression()
!29 = !DILocation(line: 15, column: 15, scope: !10)
!30 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !10, file: !1, line: 15, type: !14)
!31 = !DILocation(line: 15, column: 28, scope: !10)
!32 = !DILocation(line: 20, column: 15, scope: !33)
!33 = distinct !DILexicalBlock(scope: !10, file: !1, line: 20, column: 10)
!34 = !DILocation(line: 20, column: 10, scope: !10)
!35 = !DILocation(line: 21, column: 9, scope: !36)
!36 = distinct !DILexicalBlock(scope: !33, file: !1, line: 20, column: 20)
!37 = !DILocation(line: 22, column: 9, scope: !36)
!38 = !DILocation(line: 25, column: 22, scope: !10)
!39 = !DILocation(line: 25, column: 17, scope: !10)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "MatrixDim", scope: !10, file: !1, line: 16, type: !13)
!41 = !DILocation(line: 16, column: 15, scope: !10)
!42 = !DILocation(line: 26, column: 50, scope: !10)
!43 = !DILocation(line: 26, column: 49, scope: !10)
!44 = !DILocation(line: 26, column: 24, scope: !10)
!45 = !DILocation(line: 26, column: 9, scope: !10)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "L", scope: !10, file: !1, line: 17, type: !4)
!47 = !DILocation(line: 17, column: 22, scope: !10)
!48 = !DILocation(line: 27, column: 50, scope: !10)
!49 = !DILocation(line: 27, column: 49, scope: !10)
!50 = !DILocation(line: 27, column: 24, scope: !10)
!51 = !DILocation(line: 27, column: 9, scope: !10)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "U", scope: !10, file: !1, line: 17, type: !4)
!53 = !DILocation(line: 17, column: 27, scope: !10)
!54 = !DILocation(line: 28, column: 50, scope: !10)
!55 = !DILocation(line: 28, column: 49, scope: !10)
!56 = !DILocation(line: 28, column: 24, scope: !10)
!57 = !DILocation(line: 28, column: 9, scope: !10)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "A", scope: !10, file: !1, line: 17, type: !4)
!59 = !DILocation(line: 17, column: 32, scope: !10)
!60 = !DILocation(line: 30, column: 11, scope: !61)
!61 = distinct !DILexicalBlock(scope: !10, file: !1, line: 30, column: 10)
!62 = !DILocation(line: 30, column: 13, scope: !61)
!63 = !DILocation(line: 30, column: 17, scope: !64)
!64 = !DILexicalBlockFile(scope: !61, file: !1, discriminator: 1)
!65 = !DILocation(line: 30, column: 19, scope: !61)
!66 = !DILocation(line: 30, column: 23, scope: !67)
!67 = !DILexicalBlockFile(scope: !61, file: !1, discriminator: 2)
!68 = !DILocation(line: 30, column: 10, scope: !10)
!69 = !DILocation(line: 31, column: 9, scope: !70)
!70 = distinct !DILexicalBlock(scope: !61, file: !1, line: 30, column: 25)
!71 = !DILocation(line: 32, column: 13, scope: !72)
!72 = distinct !DILexicalBlock(scope: !70, file: !1, line: 32, column: 13)
!73 = !DILocation(line: 32, column: 13, scope: !70)
!74 = !DILocation(line: 32, column: 21, scope: !75)
!75 = !DILexicalBlockFile(scope: !72, file: !1, discriminator: 1)
!76 = !DILocation(line: 32, column: 16, scope: !72)
!77 = !DILocation(line: 33, column: 13, scope: !78)
!78 = distinct !DILexicalBlock(scope: !70, file: !1, line: 33, column: 13)
!79 = !DILocation(line: 33, column: 13, scope: !70)
!80 = !DILocation(line: 33, column: 21, scope: !81)
!81 = !DILexicalBlockFile(scope: !78, file: !1, discriminator: 1)
!82 = !DILocation(line: 33, column: 16, scope: !78)
!83 = !DILocation(line: 34, column: 13, scope: !84)
!84 = distinct !DILexicalBlock(scope: !70, file: !1, line: 34, column: 13)
!85 = !DILocation(line: 34, column: 13, scope: !70)
!86 = !DILocation(line: 34, column: 21, scope: !87)
!87 = !DILexicalBlockFile(scope: !84, file: !1, discriminator: 1)
!88 = !DILocation(line: 34, column: 16, scope: !84)
!89 = !DILocation(line: 35, column: 9, scope: !70)
!90 = !DILocation(line: 38, column: 11, scope: !10)
!91 = !DILocation(line: 38, column: 5, scope: !10)
!92 = !DILocation(line: 40, column: 5, scope: !10)
!93 = !DILocation(line: 41, column: 10, scope: !10)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fl", scope: !10, file: !1, line: 18, type: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !97, line: 49, baseType: !98)
!97 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !99, line: 273, size: 1728, align: 64, elements: !100)
!99 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !121, !122, !123, !124, !128, !130, !132, !136, !139, !141, !142, !143, !144, !145, !149, !150}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !98, file: !99, line: 274, baseType: !13, size: 32, align: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !98, file: !99, line: 279, baseType: !15, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !98, file: !99, line: 280, baseType: !15, size: 64, align: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !98, file: !99, line: 281, baseType: !15, size: 64, align: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !98, file: !99, line: 282, baseType: !15, size: 64, align: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !98, file: !99, line: 283, baseType: !15, size: 64, align: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !98, file: !99, line: 284, baseType: !15, size: 64, align: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !98, file: !99, line: 285, baseType: !15, size: 64, align: 64, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !98, file: !99, line: 286, baseType: !15, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !98, file: !99, line: 288, baseType: !15, size: 64, align: 64, offset: 576)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !98, file: !99, line: 289, baseType: !15, size: 64, align: 64, offset: 640)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !98, file: !99, line: 290, baseType: !15, size: 64, align: 64, offset: 704)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !98, file: !99, line: 292, baseType: !114, size: 64, align: 64, offset: 768)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !99, line: 188, size: 192, align: 64, elements: !116)
!116 = !{!117, !118, !120}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !115, file: !99, line: 189, baseType: !114, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !115, file: !99, line: 190, baseType: !119, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !115, file: !99, line: 194, baseType: !13, size: 32, align: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !98, file: !99, line: 294, baseType: !119, size: 64, align: 64, offset: 832)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !98, file: !99, line: 296, baseType: !13, size: 32, align: 32, offset: 896)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !98, file: !99, line: 300, baseType: !13, size: 32, align: 32, offset: 928)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !98, file: !99, line: 302, baseType: !125, size: 64, align: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !126, line: 141, baseType: !127)
!126 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!127 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !98, file: !99, line: 306, baseType: !129, size: 16, align: 16, offset: 1024)
!129 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !98, file: !99, line: 307, baseType: !131, size: 8, align: 8, offset: 1040)
!131 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !98, file: !99, line: 308, baseType: !133, size: 8, align: 8, offset: 1048)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, align: 8, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 1)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !98, file: !99, line: 312, baseType: !137, size: 64, align: 64, offset: 1088)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !99, line: 182, baseType: null)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !98, file: !99, line: 321, baseType: !140, size: 64, align: 64, offset: 1152)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !126, line: 142, baseType: !127)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !98, file: !99, line: 330, baseType: !8, size: 64, align: 64, offset: 1216)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !98, file: !99, line: 331, baseType: !8, size: 64, align: 64, offset: 1280)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !98, file: !99, line: 332, baseType: !8, size: 64, align: 64, offset: 1344)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !98, file: !99, line: 333, baseType: !8, size: 64, align: 64, offset: 1408)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !98, file: !99, line: 334, baseType: !146, size: 64, align: 64, offset: 1472)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !147, line: 62, baseType: !148)
!147 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!148 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !98, file: !99, line: 336, baseType: !13, size: 32, align: 32, offset: 1536)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !98, file: !99, line: 338, baseType: !151, size: 160, align: 8, offset: 1568)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 160, align: 8, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 20)
!154 = !DILocation(line: 18, column: 11, scope: !10)
!155 = !DILocation(line: 42, column: 12, scope: !156)
!156 = distinct !DILexicalBlock(scope: !10, file: !1, line: 42, column: 9)
!157 = !DILocation(line: 42, column: 9, scope: !10)
!158 = !DILocation(line: 43, column: 9, scope: !159)
!159 = distinct !DILexicalBlock(scope: !156, file: !1, line: 42, column: 21)
!160 = !DILocation(line: 44, column: 9, scope: !159)
!161 = !DILocation(line: 47, column: 5, scope: !10)
!162 = !DILocation(line: 48, column: 10, scope: !10)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fu", scope: !10, file: !1, line: 18, type: !95)
!164 = !DILocation(line: 18, column: 15, scope: !10)
!165 = !DILocation(line: 49, column: 12, scope: !166)
!166 = distinct !DILexicalBlock(scope: !10, file: !1, line: 49, column: 9)
!167 = !DILocation(line: 49, column: 9, scope: !10)
!168 = !DILocation(line: 50, column: 9, scope: !169)
!169 = distinct !DILexicalBlock(scope: !166, file: !1, line: 49, column: 21)
!170 = !DILocation(line: 51, column: 9, scope: !169)
!171 = !DILocation(line: 54, column: 5, scope: !10)
!172 = !DILocation(line: 55, column: 10, scope: !10)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fa", scope: !10, file: !1, line: 18, type: !95)
!174 = !DILocation(line: 18, column: 19, scope: !10)
!175 = !DILocation(line: 56, column: 10, scope: !176)
!176 = distinct !DILexicalBlock(scope: !10, file: !1, line: 56, column: 9)
!177 = !DILocation(line: 56, column: 9, scope: !10)
!178 = !DILocation(line: 57, column: 9, scope: !179)
!179 = distinct !DILexicalBlock(scope: !176, file: !1, line: 56, column: 14)
!180 = !DILocation(line: 58, column: 9, scope: !179)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !10, file: !1, line: 16, type: !13)
!182 = !DILocation(line: 16, column: 9, scope: !10)
!183 = !DILocation(line: 61, column: 10, scope: !184)
!184 = distinct !DILexicalBlock(scope: !10, file: !1, line: 61, column: 5)
!185 = !DILocation(line: 61, column: 17, scope: !186)
!186 = distinct !DILexicalBlock(scope: !184, file: !1, line: 61, column: 5)
!187 = !DILocation(line: 61, column: 5, scope: !184)
!188 = !DILocation(line: 62, column: 51, scope: !189)
!189 = distinct !DILexicalBlock(scope: !186, file: !1, line: 61, column: 35)
!190 = !DILocation(line: 62, column: 50, scope: !189)
!191 = !DILocation(line: 62, column: 26, scope: !189)
!192 = !DILocation(line: 62, column: 14, scope: !189)
!193 = !DILocation(line: 62, column: 9, scope: !189)
!194 = !DILocation(line: 62, column: 13, scope: !189)
!195 = !DILocation(line: 63, column: 51, scope: !189)
!196 = !DILocation(line: 63, column: 50, scope: !189)
!197 = !DILocation(line: 63, column: 26, scope: !189)
!198 = !DILocation(line: 63, column: 14, scope: !189)
!199 = !DILocation(line: 63, column: 9, scope: !189)
!200 = !DILocation(line: 63, column: 13, scope: !189)
!201 = !DILocation(line: 64, column: 51, scope: !189)
!202 = !DILocation(line: 64, column: 50, scope: !189)
!203 = !DILocation(line: 64, column: 26, scope: !189)
!204 = !DILocation(line: 64, column: 14, scope: !189)
!205 = !DILocation(line: 64, column: 9, scope: !189)
!206 = !DILocation(line: 64, column: 13, scope: !189)
!207 = !DILocation(line: 65, column: 5, scope: !189)
!208 = !DILocation(line: 61, column: 32, scope: !186)
!209 = !DILocation(line: 61, column: 5, scope: !186)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !10, file: !1, line: 16, type: !13)
!211 = !DILocation(line: 16, column: 11, scope: !10)
!212 = !DILocation(line: 79, column: 27, scope: !213)
!213 = distinct !DILexicalBlock(scope: !214, file: !1, line: 78, column: 20)
!214 = distinct !DILexicalBlock(scope: !215, file: !1, line: 75, column: 24)
