; ModuleID = '/home/gleison/lge/dawn-3.7/UniBench/benchmarks//Parboil/spmv/src/mmio.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.1 = private unnamed_addr constant [60 x i8] c"mm_read_unsymetric: Could not process Matrix Market banner \00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c" in file [%s]\0A\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.3 = private unnamed_addr constant [42 x i8] c"Sorry, this application does not support \00", align 1
@.str.4 = private unnamed_addr constant [26 x i8] c"Market Market type: [%s]\0A\00", align 1
@.str.5 = private unnamed_addr constant [57 x i8] c"read_unsymmetric_sparse(): could not parse matrix size.\0A\00", align 1
@.str.6 = private unnamed_addr constant [11 x i8] c"%d %d %lg\0A\00", align 1
@.str.7 = private unnamed_addr constant [15 x i8] c"%s %s %s %s %s\00", align 1
@.str.8 = private unnamed_addr constant [15 x i8] c"%%MatrixMarket\00", align 1
@.str.9 = private unnamed_addr constant [7 x i8] c"matrix\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !11)
!1 = !DIFile(filename: "/home/gleison/lge/dawn-3.7/UniBench/benchmarks//Parboil/spmv/src/mmio.c", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!2 = !{}
!3 = !{!4, !5, !7, !9}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!11 = !{!12, !19, !22, !90, !93, !96, !99, !102, !105, !108, !111, !114, !117, !120}
!12 = !DISubprogram(name: "mm_read_unsymmetric_sparse", scope: !1, file: !1, line: 17, type: !13, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i8*, i32*, i32*, i32*, double**, i32**, i32**)* @mm_read_unsymmetric_sparse, variables: !2)
!13 = !DISubroutineType(types: !14)
!14 = !{!6, !15, !5, !5, !5, !17, !18, !18}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!19 = !DISubprogram(name: "mm_is_valid", scope: !1, file: !1, line: 86, type: !20, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i8*)* @mm_is_valid, variables: !2)
!20 = !DISubroutineType(types: !21)
!21 = !{!6, !9}
!22 = !DISubprogram(name: "mm_read_banner", scope: !1, file: !1, line: 96, type: !23, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct._IO_FILE*, [4 x i8]*)* @mm_read_banner, variables: !2)
!23 = !DISubroutineType(types: !24)
!24 = !{!6, !25, !84}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !27, line: 49, baseType: !28)
!27 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !29, line: 273, size: 1728, align: 64, elements: !30)
!29 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !51, !52, !53, !54, !58, !60, !62, !66, !69, !71, !72, !73, !74, !75, !79, !80}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !28, file: !29, line: 274, baseType: !6, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !28, file: !29, line: 279, baseType: !9, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !28, file: !29, line: 280, baseType: !9, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !28, file: !29, line: 281, baseType: !9, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !28, file: !29, line: 282, baseType: !9, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !28, file: !29, line: 283, baseType: !9, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !28, file: !29, line: 284, baseType: !9, size: 64, align: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !28, file: !29, line: 285, baseType: !9, size: 64, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !28, file: !29, line: 286, baseType: !9, size: 64, align: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !28, file: !29, line: 288, baseType: !9, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !28, file: !29, line: 289, baseType: !9, size: 64, align: 64, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !28, file: !29, line: 290, baseType: !9, size: 64, align: 64, offset: 704)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !28, file: !29, line: 292, baseType: !44, size: 64, align: 64, offset: 768)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !29, line: 188, size: 192, align: 64, elements: !46)
!46 = !{!47, !48, !50}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !45, file: !29, line: 189, baseType: !44, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !45, file: !29, line: 190, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !45, file: !29, line: 194, baseType: !6, size: 32, align: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !28, file: !29, line: 294, baseType: !49, size: 64, align: 64, offset: 832)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !28, file: !29, line: 296, baseType: !6, size: 32, align: 32, offset: 896)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !28, file: !29, line: 300, baseType: !6, size: 32, align: 32, offset: 928)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !28, file: !29, line: 302, baseType: !55, size: 64, align: 64, offset: 960)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !56, line: 141, baseType: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!57 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !28, file: !29, line: 306, baseType: !59, size: 16, align: 16, offset: 1024)
!59 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !28, file: !29, line: 307, baseType: !61, size: 8, align: 8, offset: 1040)
!61 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !28, file: !29, line: 308, baseType: !63, size: 8, align: 8, offset: 1048)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, align: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 1)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !28, file: !29, line: 312, baseType: !67, size: 64, align: 64, offset: 1088)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !29, line: 182, baseType: null)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !28, file: !29, line: 321, baseType: !70, size: 64, align: 64, offset: 1152)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !56, line: 142, baseType: !57)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !28, file: !29, line: 330, baseType: !4, size: 64, align: 64, offset: 1216)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !28, file: !29, line: 331, baseType: !4, size: 64, align: 64, offset: 1280)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !28, file: !29, line: 332, baseType: !4, size: 64, align: 64, offset: 1344)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !28, file: !29, line: 333, baseType: !4, size: 64, align: 64, offset: 1408)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !28, file: !29, line: 334, baseType: !76, size: 64, align: 64, offset: 1472)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 62, baseType: !78)
!77 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!78 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !28, file: !29, line: 336, baseType: !6, size: 32, align: 32, offset: 1536)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !28, file: !29, line: 338, baseType: !81, size: 160, align: 8, offset: 1568)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 20)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "MM_typecode", file: !86, line: 16, baseType: !87)
!86 = !DIFile(filename: "/home/gleison/lge/dawn-3.7/UniBench/benchmarks//Parboil/spmv/src/mmio.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 4)
!90 = !DISubprogram(name: "mm_write_mtx_crd_size", scope: !1, file: !1, line: 181, type: !91, isLocal: false, isDefinition: true, scopeLine: 182, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct._IO_FILE*, i32, i32, i32)* @mm_write_mtx_crd_size, variables: !2)
!91 = !DISubroutineType(types: !92)
!92 = !{!6, !25, !6, !6, !6}
!93 = !DISubprogram(name: "mm_read_mtx_crd_size", scope: !1, file: !1, line: 189, type: !94, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct._IO_FILE*, i32*, i32*, i32*)* @mm_read_mtx_crd_size, variables: !2)
!94 = !DISubroutineType(types: !95)
!95 = !{!6, !25, !5, !5, !5}
!96 = !DISubprogram(name: "mm_read_mtx_array_size", scope: !1, file: !1, line: 220, type: !97, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct._IO_FILE*, i32*, i32*)* @mm_read_mtx_array_size, variables: !2)
!97 = !DISubroutineType(types: !98)
!98 = !{!6, !25, !5, !5}
!99 = !DISubprogram(name: "mm_write_mtx_array_size", scope: !1, file: !1, line: 249, type: !100, isLocal: false, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct._IO_FILE*, i32, i32)* @mm_write_mtx_array_size, variables: !2)
!100 = !DISubroutineType(types: !101)
!101 = !{!6, !25, !6, !6}
!102 = !DISubprogram(name: "mm_read_mtx_crd_data", scope: !1, file: !1, line: 265, type: !103, isLocal: false, isDefinition: true, scopeLine: 267, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct._IO_FILE*, i32, i32, i32, i32*, i32*, double*, i8*)* @mm_read_mtx_crd_data, variables: !2)
!103 = !DISubroutineType(types: !104)
!104 = !{!6, !25, !6, !6, !6, !5, !5, !7, !9}
!105 = !DISubprogram(name: "mm_read_mtx_crd_entry", scope: !1, file: !1, line: 298, type: !106, isLocal: false, isDefinition: true, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct._IO_FILE*, i32*, i32*, double*, double*, i8*)* @mm_read_mtx_crd_entry, variables: !2)
!106 = !DISubroutineType(types: !107)
!107 = !{!6, !25, !5, !5, !7, !7, !9}
!108 = !DISubprogram(name: "mm_read_mtx_crd", scope: !1, file: !1, line: 333, type: !109, isLocal: false, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i8*, i32*, i32*, i32*, i32**, i32**, double**, [4 x i8]*)* @mm_read_mtx_crd, variables: !2)
!109 = !DISubroutineType(types: !110)
!110 = !{!6, !9, !5, !5, !5, !18, !18, !17, !84}
!111 = !DISubprogram(name: "mm_write_banner", scope: !1, file: !1, line: 386, type: !112, isLocal: false, isDefinition: true, scopeLine: 387, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct._IO_FILE*, i8*)* @mm_write_banner, variables: !2)
!112 = !DISubroutineType(types: !113)
!113 = !{!6, !25, !9}
!114 = !DISubprogram(name: "mm_write_mtx_crd", scope: !1, file: !1, line: 399, type: !115, isLocal: false, isDefinition: true, scopeLine: 401, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i8*, i32, i32, i32, i32*, i32*, double*, i8*)* @mm_write_mtx_crd, variables: !2)
!115 = !DISubroutineType(types: !116)
!116 = !{!6, !9, !6, !6, !6, !5, !5, !7, !9}
