; ModuleID = '/home/gleison/lge/dawn-3.7/UniBench/benchmarks//Parboil/mri-q/src/file.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [24 x i8] c"Cannot open input file\0A\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.3 = private unnamed_addr constant [25 x i8] c"Cannot open output file\0A\00", align 1

; Function Attrs: uwtable
define void @inputData(i8* %fName, i32* %_numK, i32* %_numX, float** %kx, float** %ky, float** %kz, float** %x, float** %y, float** %z, float** %phiR, float** %phiI) #0 {
entry:
  %numK = alloca i32, align 4
  %numX = alloca i32, align 4
  call void @llvm.dbg.value(metadata i8* %fName, i64 0, metadata !74, metadata !75), !dbg !76
  call void @llvm.dbg.value(metadata i32* %_numK, i64 0, metadata !77, metadata !75), !dbg !78
  call void @llvm.dbg.value(metadata i32* %_numX, i64 0, metadata !79, metadata !75), !dbg !80
  call void @llvm.dbg.value(metadata float** %kx, i64 0, metadata !81, metadata !75), !dbg !82

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !62)
!1 = !DIFile(filename: "/home/gleison/lge/dawn-3.7/UniBench/benchmarks//Parboil/mri-q/src/file.cc", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!2 = !{}
!3 = !{!4, !59, !60}
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !5, line: 273, size: 1728, align: 64, elements: !6, identifier: "_ZTS8_IO_FILE")
!5 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!6 = !{!7, !9, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !24, !26, !27, !28, !32, !34, !36, !40, !43, !45, !47, !48, !49, !50, !54, !55}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS8_IO_FILE", file: !5, line: 274, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !"_ZTS8_IO_FILE", file: !5, line: 279, baseType: !10, size: 64, align: 64, offset: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !"_ZTS8_IO_FILE", file: !5, line: 280, baseType: !10, size: 64, align: 64, offset: 128)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !"_ZTS8_IO_FILE", file: !5, line: 281, baseType: !10, size: 64, align: 64, offset: 192)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !"_ZTS8_IO_FILE", file: !5, line: 282, baseType: !10, size: 64, align: 64, offset: 256)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !"_ZTS8_IO_FILE", file: !5, line: 283, baseType: !10, size: 64, align: 64, offset: 320)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !"_ZTS8_IO_FILE", file: !5, line: 284, baseType: !10, size: 64, align: 64, offset: 384)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !"_ZTS8_IO_FILE", file: !5, line: 285, baseType: !10, size: 64, align: 64, offset: 448)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !"_ZTS8_IO_FILE", file: !5, line: 286, baseType: !10, size: 64, align: 64, offset: 512)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !"_ZTS8_IO_FILE", file: !5, line: 288, baseType: !10, size: 64, align: 64, offset: 576)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !"_ZTS8_IO_FILE", file: !5, line: 289, baseType: !10, size: 64, align: 64, offset: 640)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !"_ZTS8_IO_FILE", file: !5, line: 290, baseType: !10, size: 64, align: 64, offset: 704)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !"_ZTS8_IO_FILE", file: !5, line: 292, baseType: !23, size: 64, align: 64, offset: 768)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS10_IO_marker", size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !"_ZTS8_IO_FILE", file: !5, line: 294, baseType: !25, size: 64, align: 64, offset: 832)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8_IO_FILE", size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !"_ZTS8_IO_FILE", file: !5, line: 296, baseType: !8, size: 32, align: 32, offset: 896)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !"_ZTS8_IO_FILE", file: !5, line: 300, baseType: !8, size: 32, align: 32, offset: 928)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !"_ZTS8_IO_FILE", file: !5, line: 302, baseType: !29, size: 64, align: 64, offset: 960)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 141, baseType: !31)
!30 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!31 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !"_ZTS8_IO_FILE", file: !5, line: 306, baseType: !33, size: 16, align: 16, offset: 1024)
!33 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !"_ZTS8_IO_FILE", file: !5, line: 307, baseType: !35, size: 8, align: 8, offset: 1040)
!35 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !"_ZTS8_IO_FILE", file: !5, line: 308, baseType: !37, size: 8, align: 8, offset: 1048)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, align: 8, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 1)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !"_ZTS8_IO_FILE", file: !5, line: 312, baseType: !41, size: 64, align: 64, offset: 1088)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !5, line: 182, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS8_IO_FILE", file: !5, line: 321, baseType: !44, size: 64, align: 64, offset: 1152)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 142, baseType: !31)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !"_ZTS8_IO_FILE", file: !5, line: 330, baseType: !46, size: 64, align: 64, offset: 1216)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !"_ZTS8_IO_FILE", file: !5, line: 331, baseType: !46, size: 64, align: 64, offset: 1280)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !"_ZTS8_IO_FILE", file: !5, line: 332, baseType: !46, size: 64, align: 64, offset: 1344)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !"_ZTS8_IO_FILE", file: !5, line: 333, baseType: !46, size: 64, align: 64, offset: 1408)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !"_ZTS8_IO_FILE", file: !5, line: 334, baseType: !51, size: 64, align: 64, offset: 1472)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !52, line: 62, baseType: !53)
!52 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/lge/llvm-3.7-src/build-debug/bin")
!53 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !"_ZTS8_IO_FILE", file: !5, line: 336, baseType: !8, size: 32, align: 32, offset: 1536)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !"_ZTS8_IO_FILE", file: !5, line: 338, baseType: !56, size: 160, align: 8, offset: 1568)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, align: 8, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 20)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !5, line: 188, size: 192, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!62 = !{!63, !68}
!63 = !DISubprogram(name: "inputData", scope: !1, file: !1, line: 20, type: !64, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*, i32*, i32*, float**, float**, float**, float**, float**, float**, float**, float**)* @inputData, variables: !2)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !10, !66, !66, !67, !67, !67, !67, !67, !67, !67, !67}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!68 = !DISubprogram(name: "outputData", scope: !1, file: !1, line: 57, type: !69, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*, float*, float*, i32)* @outputData, variables: !2)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !10, !60, !60, !8}
!71 = !{i32 2, !"Dwarf Version", i32 4}
!72 = !{i32 2, !"Debug Info Version", i32 3}
!73 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fName", arg: 1, scope: !63, file: !1, line: 20, type: !10)
!75 = !DIExpression()
!76 = !DILocation(line: 20, column: 22, scope: !63)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_numK", arg: 2, scope: !63, file: !1, line: 20, type: !66)
!78 = !DILocation(line: 20, column: 34, scope: !63)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_numX", arg: 3, scope: !63, file: !1, line: 20, type: !66)
!80 = !DILocation(line: 20, column: 46, scope: !63)
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kx", arg: 4, scope: !63, file: !1, line: 21, type: !67)
!82 = !DILocation(line: 21, column: 24, scope: !63)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ky", arg: 5, scope: !63, file: !1, line: 21, type: !67)
!84 = !DILocation(line: 21, column: 36, scope: !63)
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kz", arg: 6, scope: !63, file: !1, line: 21, type: !67)
!86 = !DILocation(line: 21, column: 48, scope: !63)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 7, scope: !63, file: !1, line: 22, type: !67)
!88 = !DILocation(line: 22, column: 24, scope: !63)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 8, scope: !63, file: !1, line: 22, type: !67)
!90 = !DILocation(line: 22, column: 35, scope: !63)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 9, scope: !63, file: !1, line: 22, type: !67)
!92 = !DILocation(line: 22, column: 46, scope: !63)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "phiR", arg: 10, scope: !63, file: !1, line: 23, type: !67)
!94 = !DILocation(line: 23, column: 24, scope: !63)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "phiI", arg: 11, scope: !63, file: !1, line: 23, type: !67)
!96 = !DILocation(line: 23, column: 38, scope: !63)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numK", scope: !63, file: !1, line: 25, type: !8)
!98 = !DILocation(line: 25, column: 7, scope: !63)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numX", scope: !63, file: !1, line: 25, type: !8)
!100 = !DILocation(line: 25, column: 13, scope: !63)
!101 = !DILocation(line: 26, column: 15, scope: !63)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fid", scope: !63, file: !1, line: 26, type: !103)
